---
kind: property
id: P:Autodesk.Revit.DB.PhaseArray.IsEmpty
source: html/a0239bb6-a161-0515-7ebd-8dc5008608d0.htm
---
# Autodesk.Revit.DB.PhaseArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.